export default function Page() {
  return (
    <main className="main">
      <h1>免責事項</h1>
      <h2 id="definition">定義</h2>
      <p>この利用規約における用語について以下のように定義致します。</p>
      <ol>
        <li>
          「当団体」とは、灘校パソコン研究部(Nada Personal Computer users'
          Association, npca)を指します。
        </li>
        <li>
          「当ウェブサイト」とは、当団体の運営しているウェブサイトを意味し、npca.jp及びそのサブドメインにて公開されているコンテンツ全てを指します。
        </li>
        <li>
          「当サービス」とは、当団体の運営しているサービスを意味し、npca.jp及びそのサブドメインにて運営、提供しているもの全てを指します。
        </li>
        <li>
          「当利用規約」とは、このページに掲載されている灘校パソコン研究部ウェブサイト利用規約を指します。
        </li>
        <li>
          「当利用者」とは、当ウェブサイトと当サービス及びその提供・含有する情報・著作物を利用されるすべての方を指します。
        </li>
      </ol>
      <h2 id="about">当利用規約について</h2>
      <ol>
        <li>
          当利用規約は、当ウェブサイト及び当サービスに対して適用され、当利用者は当利用規約に対して同意したものとみなされます。
        </li>
        <li>
          当利用規約は事前通知や当利用者の同意を得ることなしに変更できるものとし、当利用規約が更新された時点で当ウェブサイト及び当サービスに適用され、当利用者は更新内容について同意したものとみなされます。
        </li>
      </ol>
      <h2 id="mikuru">禁止事項について</h2>
      <p>当利用者は以下の行為をしてはならないものとします。</p>
      <ol>
        <li>当利用規約で禁止されている行為</li>
        <li>公序良俗に反する、法令・条例に違反する、またその恐れのある行為</li>
        <li>
          当ウェブサイト及び当サービスを利用した営業、営利目的、またその恐れのある行為
        </li>
        <li>
          当団体、若しくは当ウェブサイトと当サービス及びその提供・含有する情報・著作物の他の利用者の有する権利を侵害する、またその恐れのある行為
        </li>
        <li>
          当団体、若しくは当ウェブサイトと当サービス及びその提供・含有する情報・著作物の他の利用者に対して損害を与える、またその恐れのある行為
        </li>
        <li>
          当ウェブサイト及び当サービスの運営を妨げ、支障をきたす、またその恐れのある行為
        </li>
        <li>その他、当団体が不適切と認めた行為</li>
      </ol>
      <h2 id="manage">運営について</h2>
      <ol>
        <li>
          当ウェブサイト及び当サービスについて、仕様変更・運営停止・運営中止等を行う事がありますが、そのことに関する一切の損害については、事前通知がなくとも一切の責任を負い兼ねます。
        </li>
        <li>
          当利用者は、当団体、若しくは当ウェブサイトと当サービス及びその提供・含有する情報・著作物の他の利用者に対して損害を与えた場合は、その責任を負うものといたします。
        </li>
      </ol>
      <h2 id="contents">内容について</h2>
      <ol>
        <li>
          当ウェブサイト及び当サービスにて掲載・提供されているもの全てについて、当団体はその正確性・安全性・最新性・合法性・中立性等のいかなる点におきましても、保証いたしません。
        </li>
        <li>
          当利用者は、当ウェブサイト及び当サービスの利用を自己責任で行う必要があり、利用によって生じたいかなる損害についても当団体は一切の責任を負い兼ねます。
        </li>
        <li>
          当ウェブサイト及び当サービスにてリンクが掲載されている当団体が運営していないウェブサイト及びサービスは、その正確性・安全性・最新性・合法性・中立性等のいかなる点におきましても、保証いたしません。
        </li>
        <li>
          当ウェブサイト及び当サービスにてリンクが掲載されている当団体が運営していないウェブサイト及びサービスは、当利用者の自己責任で利用するものとし、利用によって生じたいかなる損害についても当団体は一切の責任を負い兼ねます。
        </li>
      </ol>
      <h2 id="right">権利について</h2>
      <ol>
        <li>
          当ウェブサイト及び当サービスにて掲載・提供されているもの全てに関する知的財産権について、特に明示されているものを除き、当団体に帰属するものとします。
        </li>
        <li>
          当利用者が、当ウェブサイト及び当サービスにアップロードしたもの全てについて、特に明示されているものを除き、その知的財産権・著作権を当団体に譲渡したものとみなします。
        </li>
        <li>
          当利用者が、当ウェブサイト及び当サービスにて掲載・提供されているもののうち、二次利用を許諾していない旨が明示されているものについ
          て、当団体による事前の了承なしに一部または全部を頒布・改造・使用許諾・貸与・売却・譲渡・実演等の当団体の有する権利の侵害する行為を行った場合は、
          一切の損害を賠償する責任を負うものとします。
        </li>
        <li>
          当ウェブサイト及び当サービスにて掲載・提供されているものについて、その頒布・改造等の二次利用を行う際には、当利用者の自己責任で利用するものとし、利用によって生じたいかなる損害についても当団体は一切の責任を負い兼ねます。
        </li>
      </ol>
      <h2 id="privacy">個人情報について</h2>
      <ol>
        <li>
          当ウェブサイト及び当サービスでは、IPアドレス、アクセスしたURLの履歴及びファーストパーティCookieによる匿名のトラフィックデータを収集しており、当利用者はそのことに対して同意したものとみなされます。
        </li>
        <li>
          当利用者が、当ウェブサイト及び当サービスにて送信した、個人が特定可能な氏名・メールアドレス等の情報につきましては法令に基づく開示請
          求があった場合、不正アクセスその他特別の理由のある場合を除き、当ウェブサイト及び当サービスの運営、改善等の行為以外のために自ら利用し、又は第三者
          に提供致しません。
        </li>
        <li>
          当団体は、当利用者が送信した、個人が特定可能な氏名、メールアドレスなどの情報の管理につきましては、当団体の過失と認められる場合を除き、一切の責任を負い兼ねます。
        </li>
      </ol>
      <h2 id="else">その他</h2>
      <ol>
        <li>当利用規約は、日本法に従って解釈・適用されるものとします。</li>
        <li>
          当ウェブサイト及び当サービスに関する当団体と当利用者間の訴訟については、神戸地方裁判所または神戸簡易裁判所を第一審の専属的合意管轄裁判所といたします。
        </li>
      </ol>
    </main>
  );
}
